/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 CCP在多个口之间切换举例-----------------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"
#define FOSC 18432000L

//-----------------------------------------

sfr P_SW1   = 0xA2;             //外设功能切换寄存器1

#define CCP_S0 0x10             //P_SW1.4
#define CCP_S1 0x20             //P_SW1.5

//-----------------------------------------

void main()
{
    ACC = P_SW1;
    ACC &= ~(CCP_S0 | CCP_S1);  //CCP_S0=0 CCP_S1=0
    P_SW1 = ACC;                //(P1.2/ECI, P1.1/CCP0, P1.0/CCP1, P3.7/CCP2)
    
//  ACC = P_SW1;
//  ACC &= ~(CCP_S0 | CCP_S1);  //CCP_S0=1 CCP_S1=0
//  ACC |= CCP_S0;              //(P3.4/ECI_2, P3.5/CCP0_2, P3.6/CCP1_2, P3.7/CCP2_2)
//  P_SW1 = ACC;  
//  
//  ACC = P_SW1;
//  ACC &= ~(CCP_S0 | CCP_S1);  //CCP_S0=0 CCP_S1=1
//  ACC |= CCP_S1;              //(P2.4/ECI_3, P2.5/CCP0_3, P2.6/CCP1_3, P2.7/CCP2_3)
//  P_SW1 = ACC;  

    while (1);                  //程序终止
}

