/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 SPI在多个口之间切换举例-----------------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"
#define FOSC 18432000L

//-----------------------------------------

sfr P_SW1   = 0xA2;             //外设功能切换寄存器1

#define SPI_S0 0x04             //P_SW1.2
#define SPI_S1 0x08             //P_SW1.3

//-----------------------------------------

void main()
{
    ACC = P_SW1;
    ACC &= ~(SPI_S0 | SPI_S1);  //SPI_S0=0 SPI_S1=0
    P_SW1 = ACC;                //(P1.2/SS, P1.3/MOSI, P1.4/MISO, P1.5/SCLK)
    
//  ACC = P_SW1;
//  ACC &= ~(SPI_S0 | SPI_S1);  //SPI_S0=1 SPI_S1=0
//  ACC |= SPI_S0;              //(P2.4/SS_2, P2.3/MOSI_2, P2.2/MISO_2, P2.1/SCLK_2)
//  P_SW1 = ACC;  
//  
//  ACC = P_SW1;
//  ACC &= ~(SPI_S0 | SPI_S1);  //SPI_S0=0 SPI_S1=1
//  ACC |= SPI_S1;              //(P5.4/SS_3, P4.0/MOSI_3, P4.1/MISO_3, P4.3/SCLK_3)
//  P_SW1 = ACC;  

    while (1);                  //程序终止
}

