/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 T2扩展为外部下降沿中断举例--------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"
#include "intrins.h"

//-----------------------------------------------

sfr IE2       = 0xaf;               //中断使能寄存器2
sfr AUXR      = 0x8e;          	    //辅助寄存器
sfr T2H       = 0xD6;               //定时器2高8位
sfr T2L       = 0xD7;               //定时器2低8位

sbit P10 = P1^0;

//-----------------------------------------------
//中断服务程序
void t2int() interrupt 12           //中断入口
{
    P10 = !P10;                     //将测试口取反
      
//  IE2 &= ~0x04;                   //若需要手动清除中断标志,可先关闭中断,此时系统会自动清除内部的中断标志
//  IE2 |= 0x04;                    //然后再开中断即可
}

void main()
{
    AUXR |= 0x04;                   //定时器2为1T模式
    AUXR |= 0x08;                   //T2_C/T=1, T2(P3.1)引脚为时钟源
    T2H = T2L = 0xff;               //初始化计时值
    AUXR |= 0x10;                   //定时器2开始计时
    
    IE2 |= 0x04;                    //开定时器2中断

    EA = 1;

    while (1);
}

