/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 定时器0可编程时钟分频输出举例-----------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"

typedef unsigned char BYTE;
typedef unsigned int WORD;

#define FOSC 18432000L

//-----------------------------------------------

sfr AUXR      = 0x8e;               //辅助特殊功能寄存器
sfr INT_CLKO  = 0x8f;               //唤醒和时钟输出功能寄存器

sbit T0CLKO   = P3^5;               //定时器0的时钟输出脚

#define F38_4KHz (65536-FOSC/2/38400)    //1T模式
//#define F38_4KHz (65536-FOSC/2/12/38400) //12T模式

//-----------------------------------------------

void main()
{
    AUXR |= 0x80;                 	//定时器0为1T模式
//  AUXR &= ~0x80;                	//定时器0为12T模式

    TMOD = 0x00;                    //设置定时器为模式0(16位自动重装载)
    
    TMOD &= ~0x04;                  //C/T0=0, 对内部时钟进行时钟输出
//  TMOD |= 0x04;                   //C/T0=1, 对T0引脚的外部时钟进行时钟输出

    TL0 = F38_4KHz;                 //初始化计时值
    TH0 = F38_4KHz >> 8;
    TR0 = 1;
    INT_CLKO = 0x01;                //使能定时器0的时钟输出功能

    while (1);                      //程序终止
}

