/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 定时器软件模拟PWM举例-------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"

//#define PWM6BIT   64              //6-bit PWM 周期数
#define PWM8BIT     256             //8-bit PWM 周期数
//#define PWM10BIT  1024            //10-bit PWM 周期数
//#define PWM16BIT  65536           //16-bit PWM 周期数

#define HIGHDUTY 64                 //高电平周期数(占空比64/256=25%)
#define LOWDUTY  (PWM8BIT-HIGHDUTY) //低电平周期数

sfr AUXR      = 0x8e;               //辅助寄存器
sfr INT_CLKO  = 0x8f;               //时钟输出控制寄存器
sbit T0CLKO   = P3^5;               //定时器0的时钟输出口

bit flag;

//定时器0中断服务程序
void tm0() interrupt 1
{
	flag = !flag;                   //反转PWM的输出标志
	if (flag)
	{
		TL0 = (65536-HIGHDUTY);     //准备高电平的重载值
		TH0 = (65536-HIGHDUTY) >> 8;
	}
	else
	{
		TL0 = (65536-LOWDUTY);      //准备低电平的重载值
		TH0 = (65536-LOWDUTY) >> 8;
	}
}

void main()
{
	AUXR = 0x80;                    //定时器0为1T模式
	INT_CLKO = 0x01;                //使能定时器0的时钟输出功能
	TMOD &= 0xf0;                   //设置定时器0为模式0(16位自动重装载)
	TL0 = (65536-LOWDUTY);          //初始化定时器初值和重装值
	TH0 = (65536-LOWDUTY) >> 8;
	T0CLKO = 1;                     //初始化时钟输出脚(软PWM口)
	flag = 0;                       //初始化标志位
	TR0 = 1;                        //定时器0开始计时
	ET0 = 1;                        //使能定时器0中断
	EA = 1;
	while (1);
}

