/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 定时器3的16位自动重装载模式举例---------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"

typedef unsigned char BYTE;
typedef unsigned int WORD;

//-----------------------------------------------

#define FOSC 18432000L

#define T38_4KHz (256-18432000/38400/2)         //1T
//#define T38_4KHz (256-18432000/12/38400/2)    //12T

sfr IE2     = 0xAF;                 //中断使能寄存器2
sfr T4T3M 	= 0xD1;                 //定时器3和定时器4控制寄存器
sfr T4H     = 0xD2;                 //定时器4高8位
sfr T4L     = 0xD3;                 //定时器4低8位
sfr T3H     = 0xD4;                 //定时器3高8位
sfr T3L     = 0xD5;                 //定时器3低8位

sbit P10 = P1^0;

//-----------------------------------------------
//中断服务程序
void t3int() interrupt 19           //中断入口
{
    P10 = !P10;                     //将测试口取反
      
//  IE2 &= ~0x20;                   //若需要手动清除中断标志,可先关闭中断,此时系统会自动清除内部的中断标志
//  IE2 |= 0x20;                    //然后再开中断即可
}

//-----------------------------------------------

void main()
{
    T4T3M |= 0x02;                 	//定时器3为1T模式
//  T4T3M &= ~0x02;                	//定时器3为12T模式

    T3L = T38_4KHz;                 //初始化计时值
    T3H = T38_4KHz >> 8;
    
    T4T3M |= 0x08;                  //定时器3开始计时
    IE2 |= 0x20;                    //开定时器3中断
    
    EA = 1;

    while (1);
}

