/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 低速模式举例----------------------------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

sfr CLK_DIV     = 0x97;         //时钟分频寄存器

//-----------------------------------------------

void main()
{
    CLK_DIV = 0x00;             //系统时钟为内部R/C振荡时钟
//  CLK_DIV = 0x01;             //系统时钟为内部R/C振荡时钟/2
//  CLK_DIV = 0x02;             //系统时钟为内部R/C振荡时钟/4
//  CLK_DIV = 0x03;             //系统时钟为内部R/C振荡时钟/8
//  CLK_DIV = 0x04;             //系统时钟为内部R/C振荡时钟/16
//  CLK_DIV = 0x05;             //系统时钟为内部R/C振荡时钟/32
//  CLK_DIV = 0x06;             //系统时钟为内部R/C振荡时钟/64
//  CLK_DIV = 0x07;             //系统时钟为内部R/C振荡时钟/128
    
    while (1);                  //程序终止
}

