/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 掉电模式中指令执行流程说明--------------------*/
/* --- Mobile: (86)13922805190 -------------- -------------------------*/
/* --- Fax: 86-755-82905966 -------------------------------------------*/
/* --- Tel: 86-755-82948412 -------------------------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/* 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//假定测试芯片的工作频率为18.432MHz

#include "reg51.h"
#include "intrins.h"

//-----------------------------------------------

void main()
{
    while (1)
    {
        PCON |= 0x02;           //将STOP(PCON.1)置1,MCU将进入掉电模式
    
        _nop_();                //当有有效的掉电唤醒源产生时,若使用的是内部振荡器,则立即启动内部振荡器,在64个时钟周期后,将时钟提供给MCU,作为系统时钟
                                //                           若使用的是外部振荡器,则立即启动外部振荡器,在1024个时钟周期后,将时钟提供给MCU,作为系统时钟
                                //在时钟信号到达CPU后,若掉电唤醒源是内部32K掉电唤醒定时器、RxD和RxD2时，CPU直接从此语句开始向下执行程序代码，而不产生中断
                                //                    若掉电唤醒源是INT0、INT1、INT2、INT3、INT4、CCP0、CCP1、CCP2时，则CPU首先首先执行此语句,然后执行中断服务程序
        
        _nop_();
        _nop_();
    }
}

